data/agiliumlabs/toSignSimple.xml.signed.uri.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<soap:Header><smev:Header xmlns:smev="http://smev.gosuslugi.ru/rev120315"><smev:NodeId>1</smev:NodeId><smev:MessageId>12311111-1111-1000-01</smev:MessageId><smev:TimeStamp>2012-02-02T00:02:02</smev:TimeStamp><smev:MessageClass>REQUEST</smev:MessageClass></smev:Header>
	<wsse:Security soap:actor="http://smev.gosuslugi.ru/actors/smev" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="c2dd1a6f-e2e0-4843-9c66-e20cc57ff141">MIIDUDCCAv+gAwIBAgIKaSwK3wACAAVXoDAIBgYqhQMCAgMwZTEgMB4GCSqGSIb3DQEJARYRaW5m
b0BjcnlwdG9wcm8ucnUxCzAJBgNVBAYTAlJVMRMwEQYDVQQKEwpDUllQVE8tUFJPMR8wHQYDVQQD
ExZUZXN0IENlbnRlciBDUllQVE8tUFJPMB4XDTEzMTAwOTA5NDUwNFoXDTE0MTAwNDA3MDk0MVow
gY4xKjAoBgkqhkiG9w0BCQEWG3N0YW5pc2xhdjM0MkBtYWlsaW5hdG9yLmNvbTETMBEGA1UEAwwK
U3RhbmlzbGF2MjENMAsGA1UECwwEaG9tZTENMAsGA1UECgwEaG9tZTEPMA0GA1UEBwwGTW9zY293
MQ8wDQYDVQQIDAZNb3Njb3cxCzAJBgNVBAYTAlJVMGMwHAYGKoUDAgITMBIGByqFAwICIwEGByqF
AwICHgEDQwAEQM6YeydTDIHEmgKCZtsG+2o+F8EWpeUAA/TOKijL/ShES+b/EKH4njwnu/xel6iY
fTXWnUCj6ndXpVnaNylttUyjggFjMIIBXzAOBgNVHQ8BAf8EBAMCBsAwEwYDVR0lBAwwCgYIKwYB
BQUHAwIwHQYDVR0OBBYEFNUXmfpSF9lzhYTawuFoPcTP6HwAMB8GA1UdIwQYMBaAFG2PXgXZX6yR
F5QelZoFMDg3ehAqMFUGA1UdHwROMEwwSqBIoEaGRGh0dHA6Ly93d3cuY3J5cHRvcHJvLnJ1L0Nl
cnRFbnJvbGwvVGVzdCUyMENlbnRlciUyMENSWVBUTy1QUk8oMikuY3JsMIGgBggrBgEFBQcBAQSB
kzCBkDAzBggrBgEFBQcwAYYnaHR0cDovL3d3dy5jcnlwdG9wcm8ucnUvb2NzcG5jL29jc3Auc3Jm
MFkGCCsGAQUFBzAChk1odHRwOi8vd3d3LmNyeXB0b3Byby5ydS9DZXJ0RW5yb2xsL3BraS1zaXRl
X1Rlc3QlMjBDZW50ZXIlMjBDUllQVE8tUFJPKDIpLmNydDAIBgYqhQMCAgMDQQATySuuBOjSymIe
77wWgHrIh0aF+mRv9BfM4XTkAUDKXCtyTTHmllWT9Icf+1mf3RPemrxCPd7ah6+R1WRyjBgD</wsse:BinarySecurityToken>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><Reference URI="#body"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><DigestValue>/brvW+LcsmpJI6lC36foL4lWKmmeWXV+YgifdpOVQvk=</DigestValue></Reference></SignedInfo><SignatureValue>TRqQEqE0/3s50sTUhsfS+cn6xCzhNaj8eyR5wwu6XaObdOv7LsUWY7cdVDFMJ+iyplPlQwbbRLXw
cCwCmB5QNg==</SignatureValue><KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#c2dd1a6f-e2e0-4843-9c66-e20cc57ff141" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></KeyInfo></Signature></wsse:Security></soap:Header>
	<soap:Body wsu:Id="body"><ns:PutDocument xmlns:ns="http://www.red-soft.biz/ncore/dx/ws/smev-243" xmlns="http://www.w3.org/2004/08/xop/include" xmlns:smev="http://smev.gosuslugi.ru/rev120315"><smev:Message><smev:Sender><smev:Code>ADLR01481</smev:Code><smev:Name>innovativeWork</smev:Name></smev:Sender><smev:Recipient><smev:Code>ADLR01481</smev:Code><smev:Name>The security provider should be certified, that is why there is no much choice, Crypto Pro probably is the only one available. Bouncycastle implements</smev:Name></smev:Recipient><smev:TypeCode>GSRV</smev:TypeCode><smev:Status>REQUEST</smev:Status><smev:Date>2012-02-02T02:02:02</smev:Date><smev:ExchangeType>2</smev:ExchangeType><smev:ServiceCode>SERVICE001</smev:ServiceCode><smev:CaseNumber>CASE001</smev:CaseNumber><smev:TestMsg>SMEVTEST</smev:TestMsg></smev:Message><smev:MessageData><smev:AppData Id="appDataBody" xmlns:smev="http://smev.gosuslugi.ru/rev120315"><tns:IQueryBph xmlns:tns="http://www.red-soft.biz/schemas/shgate/common/2011/0.5" xmlns:ws="http://www.red-soft.biz/ncore/dx/ws/smev-243" Id="appDataContent"><tns:Area>Area52</tns:Area><tns:BuildingName>Название строения</tns:BuildingName><tns:CadastraNumber>1122334455667788</tns:CadastraNumber><tns:AddressZemUchBph><tns:City>innovativeWork</tns:City><tns:House>12</tns:House><tns:Street>Стаханова</tns:Street><tns:Region>Центральный</tns:Region><tns:Locality>Липецк</tns:Locality><tns:Building>1</tns:Building><tns:District>24</tns:District><tns:Apartment>47</tns:Apartment><tns:Structure>2</tns:Structure></tns:AddressZemUchBph></tns:IQueryBph></smev:AppData></smev:MessageData></ns:PutDocument></soap:Body></soap:Envelope>